package com.licslan.interview.leetcode500.dynamicprogramming;

/**
 * @author licslan
 * 动态规划 https://www.bilibili.com/video/BV11Y4y1q7YA?p=60&spm_id_from=pageDriver
 * &vd_source=bbb985ceadc8e3199d1d5a091b58155b
 * p55-p60 需要重点重复学习
 */
public class Main {


    //DP 是运筹学的一个分支 是求解决策过程最优化的过程
    //是一个多阶段的决策问题
    //一类活动过程可以分为若干个相互联系的阶段 每一个阶段都需要做出决策，每个阶段右若干个策略可供选择，
    //一个阶段的决策确定后，形成了本阶段的决策，常常影响到下一个阶段的决策，从而形成了一个过程的活动路线


    //当各个阶段策略确定后 就组成了一个策略序列 也确定了一个活动路线，在多阶段决策问题中，决策依赖于当前状态
    //又随即引起状态的转移，一个决策序列就是在变化的状态中产生出来的 “动态”由此而来
    //称解决多阶段决策最优化过程为动态规划方法



    //动态规划  与  分治法  都是把一个大问题拆分为一个小问题

    //动态规划里面小问题的解不是相互独立的 可能会影响下一个小问题的解，小的问题的解会保存起来，不用重复去计算
    //分治法里面拆分的小问题的解都是相互独立的，可以并行去求解，求出小问题的解 再合并起来得到最终解

}
